# StairsDbgShowRunCorseGeom Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsDbgShowRunCorseGeom Property
ParameterTypeId Class See Also
---
"Show Run Corse Geometry"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsDbgShowRunCorseGeom { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsDbgShowRunCorseGeom As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsDbgShowRunCorseGeom {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace